<?php
/**
 * 奥点云IM通讯
 * ============================================================================
 * 版权所有 2015-2020 风影科技，并保留所有权利。
 * 网站地址: https://www.fylesson.com
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件，未购买授权用户无论是否用于商业行为都是侵权行为！
 * 允许已购买用户对程序代码进行修改并在授权域名下使用，但是不允许对程序代码以
 * 任何形式任何目的进行二次发售，作者将依法保留追究法律责任的权力和最终解释权。
 * ============================================================================
 */

$im_config = json_decode($setting['im_config'], true);

$api = new TisApi($im_config['aodianyun']['accessId'], $im_config['aodianyun']['accessKey']);
$method = $_REQUEST['method'];


$rst = $api->$method($_REQUEST, $_GPC['tisId']);

$this->resultJson($rst);

?>